package productMVCProject.view;

public class MenuViewer {
	// 메인메뉴
	public static void mainMenuView() {
		System.out.println();
        System.out.println("================================= 온라인 쇼핑 재고 관리 프로그램 =================================");
        System.out.printf("%-20s %-20s %-20s %-20s%n", 
        				  "[1. 재고 정보 메뉴]", 
                          "[2. 주문 정보 메뉴]", 
                          "[3. 고객 정보 메뉴]", 
                          "[4. 프로그램 종료]");
        System.out.println("==========================================================================================");
        System.out.print("번호 선택 >> ");
	}

	// 재고 메뉴
	public static void productMenuView() {
		System.out.println();
        System.out.println("========================================================== 재고 정보 메뉴 ==========================================================");
        System.out.printf("%-20s %-20s %-20s %-20s %-20s %-20s%n", 
                          "[1.재고 목록 출력]",
                          "[2.재고 정보 입력]",
                          "[3.재고 정보 수정]",
                          "[4.재고 정보 삭제]",
                          "[5.재고 목록 정렬]",
                          "[6.메인 메뉴]");
        System.out.println("================================================================================================================================");
        System.out.print("번호 선택 >> ");
	}

	// 주문 메뉴
	public static void orderMenuView() {
		System.out.println();
        System.out.println("========================================================== 주문 정보 메뉴 ==========================================================");
        System.out.printf("%-20s %-20s %-20s %-20s %-20s %-20s%n", 
                          "[1.주문 목록 출력]",
                          "[2.주문 정보 입력]",
                          "[3.주문 정보 수정]",
                          "[4.주문 정보 삭제]",
                          "[5.주문 목록 정렬]",
                          "[6.메인 메뉴]");
        System.out.println("================================================================================================================================");
        System.out.print("번호 선택 >> ");
	}
	
	// 고객 메뉴
	public static void customerMenuView() {
		System.out.println();
        System.out.println("========================================================== 고객 정보 메뉴 ==========================================================");
        System.out.printf("%-20s %-20s %-20s %-20s %-20s %-20s%n", 
                          "[1.고객 목록 출력]",
                          "[2.고객 정보 입력]",
                          "[3.고객 정보 수정]",
                          "[4.고객 정보 삭제]",
                          "[5.고객 목록 정렬]",
                          "[6.메인 메뉴]");
        System.out.println("================================================================================================================================");
        System.out.print("번호 선택 >> ");
	}

}
